#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.auto_scaling.aws_autoscaling_group.auto_scaling_group will be created
  + resource "aws_autoscaling_group" "auto_scaling_group" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = "usedlcasg000"
      + max_size                  = 6
      + metrics_granularity       = "1Minute"
      + min_size                  = 3
      + name                      = "usedasg000"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + termination_policies      = [
          + "OldestInstance",
        ]
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"
    }

  # module.auto_scaling.aws_autoscaling_policy.auto_scaling_policy will be created
  + resource "aws_autoscaling_policy" "auto_scaling_policy" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "usedasg000"
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "usedasg000"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 1
    }

  # module.cloudwatch.aws_cloudwatch_log_group.vpc_flow_logs will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + name              = "clwdvpcfl001"
      + retention_in_days = 365
      + tags              = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "clwdvpcfl001"
        }
      + tags_all          = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "clwdvpcfl001"
        }
    }

  # module.cloudwatch.aws_cloudwatch_metric_alarm.auto_scaling_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "auto_scaling_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors ec2 cpu utilization"
      + alarm_name                            = "usedcwa000"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "AutoScalingGroupName" = "usedasg000"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.elb.aws_lb.web_elb will be created
  + resource "aws_lb" "web_elb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = true
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "usedelb000"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedelb000"
        }
      + tags_all                   = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedelb000"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.elb.aws_lb_listener.elb-listener will be created
  + resource "aws_lb_listener" "elb-listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.elb.aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "usedelbtg000"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedelbtg000"
        }
      + tags_all                           = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedelbtg000"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 10
          + matcher             = "200"
          + path                = "/"
          + port                = "80"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.flow_log.aws_flow_log.main will be created
  + resource "aws_flow_log" "main" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "vpcfld001"
        }
      + tags_all                 = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "vpcfld001"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.iam.aws_iam_policy.flow_logs_cloudwatch_policy will be created
  + resource "aws_iam_policy" "flow_logs_cloudwatch_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "flowlogpolicy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.iam.aws_iam_role.flow_logs_cloudwatch_role will be created
  + resource "aws_iam_role" "flow_logs_cloudwatch_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "flowlogassume"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.iam.aws_iam_role_policy_attachment.flow_logs_assume will be created
  + resource "aws_iam_role_policy_attachment" "flow_logs_assume" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.internet_gateway.aws_internet_gateway.internet_gateway will be created
  + resource "aws_internet_gateway" "internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedigw000"
        }
      + tags_all = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedigw000"
        }
      + vpc_id   = (known after apply)
    }

  # module.kms.aws_kms_key.cloudwatch_key will be created
  + resource "aws_kms_key" "cloudwatch_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 14
      + description                        = "cloudwatch vpc flow logs kms key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "key-default-1"
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:Create*",
                          + "kms:Describe*",
                          + "kms:Enable*",
                          + "kms:List*",
                          + "kms:Put*",
                          + "kms:Update*",
                          + "kms:Revoke*",
                          + "kms:Disable*",
                          + "kms:Get*",
                          + "kms:Delete*",
                          + "kms:ScheduleKeyDeletion",
                          + "kms:CancelKeyDeletion",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::798376091767:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt*",
                          + "kms:Decrypt*",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Describe*",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + kms:EncryptionContext:aws:logs:arn = "arn:aws:logs:us-west-2:798376091767:log-group:clwdvpcfl001"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-west-2.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
        }
      + tags_all                           = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
        }
    }

  # module.launch_configuration.aws_launch_configuration.launch_configuration will be created
  + resource "aws_launch_configuration" "launch_configuration" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-067f5c3d5a99edc80"
      + instance_type               = "t2.micro"
      + key_name                    = "0a6c45e4812a29026"
      + name                        = "usedlcasg000"
      + name_prefix                 = (known after apply)
      + security_groups             = (known after apply)
      + user_data                   = "0dd4f72234fcd4beb40e96a9b16d6799084944b1"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.nat_gateway.aws_eip.nat_gw_eip_0 will be created
  + resource "aws_eip" "nat_gw_eip_0" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.nat_gateway.aws_eip.nat_gw_eip_1 will be created
  + resource "aws_eip" "nat_gw_eip_1" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.nat_gateway.aws_nat_gateway.nat_gw_0 will be created
  + resource "aws_nat_gateway" "nat_gw_0" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usednatgw000"
        }
      + tags_all             = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usednatgw000"
        }
    }

  # module.nat_gateway.aws_nat_gateway.nat_gw_1 will be created
  + resource "aws_nat_gateway" "nat_gw_1" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usednatgw001"
        }
      + tags_all             = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usednatgw001"
        }
    }

  # module.route_table.aws_route_table.internet_gateway_rt_0 will be created
  + resource "aws_route_table" "internet_gateway_rt_0" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # module.route_table.aws_route_table.nat_gateway_rt_0 will be created
  + resource "aws_route_table" "nat_gateway_rt_0" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # module.route_table.aws_route_table.nat_gateway_rt_1 will be created
  + resource "aws_route_table" "nat_gateway_rt_1" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # module.route_table.aws_route_table_association.internet_gateway_rta_0 will be created
  + resource "aws_route_table_association" "internet_gateway_rta_0" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.internet_gateway_rta_1 will be created
  + resource "aws_route_table_association" "internet_gateway_rta_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.internet_gateway_rta_2 will be created
  + resource "aws_route_table_association" "internet_gateway_rta_2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.nat-gateway-pub-0 will be created
  + resource "aws_route_table_association" "nat-gateway-pub-0" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.nat-gateway-pub-1 will be created
  + resource "aws_route_table_association" "nat-gateway-pub-1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.nat-gateway-pub-2 will be created
  + resource "aws_route_table_association" "nat-gateway-pub-2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.security_group.aws_security_group.ec2 will be created
  + resource "aws_security_group" "ec2" {
      + arn                    = (known after apply)
      + description            = "ec2 app security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.84.0/23",
                  + "10.0.86.0/23",
                  + "10.0.88.0/23",
                ]
              + description      = "ec2 app security group"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "usedsgprv001"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsgprv001"
        }
      + tags_all               = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsgprv001"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group.aws_security_group.elb will be created
  + resource "aws_security_group" "elb" {
      + arn                    = (known after apply)
      + description            = "alb security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.90.0/23",
                  + "10.0.92.0/23",
                  + "10.0.94.0/23",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "alb security group"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "usedsgpub000"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsgpub000"
        }
      + tags_all               = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsgpub000"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group.aws_security_group_rule.ec2-https-egress will be created
  + resource "aws_security_group_rule" "ec2-https-egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.subnet.aws_subnet.private_0 will be created
  + resource "aws_subnet" "private_0" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.90.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsubprv000"
        }
      + tags_all                                       = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsubprv000"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private_1 will be created
  + resource "aws_subnet" "private_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.92.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsubprv001"
        }
      + tags_all                                       = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsubprv001"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private_2 will be created
  + resource "aws_subnet" "private_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.94.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsubprv001"
        }
      + tags_all                                       = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsubprv001"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.public_0 will be created
  + resource "aws_subnet" "public_0" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.84.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsubpub000"
        }
      + tags_all                                       = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsubpub000"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.public_1 will be created
  + resource "aws_subnet" "public_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.86.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsubpub001"
        }
      + tags_all                                       = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsubpub001"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.public_2 will be created
  + resource "aws_subnet" "public_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.88.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsubpub002"
        }
      + tags_all                                       = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usedsubpub002"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.64.0/19"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usevpc001"
        }
      + tags_all                             = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "usevpc001"
        }
    }

Plan: 37 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + auto_scaling_group_name   = "usedasg000"
  + auto_scaling_policy_arn   = (known after apply)
  + cloudwatch_log_group_arn  = (known after apply)
  + elb_target_group_arn      = (known after apply)
  + elb_target_group_id       = (known after apply)
  + flow_logs_cloudwatch_role = (known after apply)
  + internet_gateway_id       = (known after apply)
  + kms_key_arn               = (known after apply)
  + launch_configuration_name = "usedlcasg000"
  + nat_gw_0_id               = (known after apply)
  + nat_gw_1_id               = (known after apply)
  + security_group_ec2_id     = (known after apply)
  + security_group_elb_id     = (known after apply)
  + subnet_private_0_id       = (known after apply)
  + subnet_private_1_id       = (known after apply)
  + subnet_private_2_id       = (known after apply)
  + subnet_public_0_id        = (known after apply)
  + subnet_public_1_id        = (known after apply)
  + subnet_public_2_id        = (known after apply)
  + vpc_id                    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"
Releasing state lock. This may take a few moments...
```
</details>
*Pusher: @oliverjfletcher, Action: `pull_request`*